In [7]:
import pandas as pd
import numpy as np

In [12]:
df = pd.DataFrame(
    {
        'a' : [4, 5, 6],
        'b' : [7, 8, 9],
        'c' : [10, 11, 12]
    },
    index = [1, 2, 3]
)
df

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

In [19]:
df.loc[3, 'a']

np.int64(6)

In [20]:
df.loc[[1, 2], ['a', 'b']]

   a  b
1  4  7
2  5  8

In [ ]:
df = pd.DataFrame(
    [[4, 7, 10],
     [5, 8, 11],
     [6, 9, 12]],
     index = [1, 2, 3],
     columns = ['a', 'b', 'c']
)
df

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

In [24]:
df = pd.DataFrame(
    {
        'a': [4, 5, 6, 6, np.nan],
        'b': [7, 8, np.nan, 9, 9],
        'c': [10, 11, 12, np.nan, 12]
    },
    index = pd.MultiIndex.from_tuples(
        [('d', 1), ('d', 2), ('e', 2), ('e', 3), ('e', 4)],
        name = ['n', 'v']
    )
)
df

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0
e 2  6.0  NaN  12.0
  3  6.0  9.0   NaN
  4  NaN  9.0  12.0

In [26]:
df[df['a'] < 7]

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0
e 2  6.0  NaN  12.0
  3  6.0  9.0   NaN

In [28]:
df[df['c'] >= 7]

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0
e 2  6.0  NaN  12.0
  4  NaN  9.0  12.0

In [39]:
df = pd.DataFrame(
    {
        'a': [4, 5, 6, 6, np.nan, np.nan],
        'b': [7, 8, np.nan, 9, 9, 9],
        'c': [10, 11, 12, np.nan, 12, 12]
    },
    index = pd.MultiIndex.from_tuples(
        [('d', 1), ('d', 2), ('e', 2), ('e', 3), ('e', 4), ('e', 5)],
        name = ['n', 'v']
    )
)
df

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0
e 2  6.0  NaN  12.0
  3  6.0  9.0   NaN
  4  NaN  9.0  12.0
  5  NaN  9.0  12.0

In [40]:
df = df.drop_duplicates()
df

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0
e 2  6.0  NaN  12.0
  3  6.0  9.0   NaN
  4  NaN  9.0  12.0

In [36]:
df.drop_duplicates(keep = 'last')

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0
e 2  6.0  NaN  12.0
  3  6.0  9.0   NaN
  5  NaN  9.0  12.0

In [37]:
df.head()

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0
e 2  6.0  NaN  12.0
  3  6.0  9.0   NaN
  4  NaN  9.0  12.0

In [38]:
df.tail()

       a    b     c
n v
d 2  5.0  8.0  11.0
e 2  6.0  NaN  12.0
  3  6.0  9.0   NaN
  4  NaN  9.0  12.0
  5  NaN  9.0  12.0

In [41]:
pd.isnull(df)

         a      b      c
n v
d 1  False  False  False
  2  False  False  False
e 2  False   True  False
  3  False  False   True
  4   True  False  False

In [45]:
df['a'].isnull().sum()

np.int64(1)

In [44]:
pd.notnull(df)

         a      b      c
n v
d 1   True   True   True
  2   True   True   True
e 2   True  False   True
  3   True   True  False
  4  False   True   True

In [43]:
df.notnull().sum()

a    4
b    4
c    4
dtype: int64

In [47]:
df.a.notnull()

n  v
d  1     True
   2     True
e  2     True
   3     True
   4    False
Name: a, dtype: bool

In [53]:
df[(df.b == 7) & (df.a == 4)]

       a    b     c
n v
d 1  4.0  7.0  10.0

In [60]:
df.sample(frac=0.3) # sample 중 30% 추출

       a    b     c
n v
d 1  4.0  7.0  10.0
e 3  6.0  9.0   NaN

In [ ]:
df.sample(n = 1)

       a   b     c
n v
e 2  6.0 NaN  12.0

In [68]:
df.iloc[0:3]

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0
e 2  6.0  NaN  12.0

In [71]:
df.iloc[2:4, 0:1]

       a
n v
e 2  6.0
  3  6.0

In [73]:
df = pd.DataFrame(
    {
        'a': [1, 10, 8, 11, -1],
        'b': list('abcde'),
        'c': [1.0, 2.0, np.nan, 3.0, 4.0]
    }
)

df

    a  b    c
0   1  a  1.0
1  10  b  2.0
2   8  c  NaN
3  11  d  3.0
4  -1  e  4.0

In [77]:
df.nlargest(3, 'a')

    a  b    c
3  11  d  3.0
1  10  b  2.0
2   8  c  NaN

In [78]:
df.nsmallest(1, 'a')

   a  b    c
4 -1  e  4.0

In [ ]:
df['d'] = True

In [82]:
df['e'] = False

In [89]:
df['f'] = True
df.loc[1, 'f'] = False

In [90]:
df

    a  b    c     d      e      f
0   1  a  1.0  True  False   True
1  10  b  2.0  True  False  False
2   8  c  NaN  True  False   True
3  11  d  3.0  True  False   True
4  -1  e  4.0  True  False   True

In [91]:
df.all()

a     True
b     True
c     True
d     True
e    False
f    False
dtype: bool

In [92]:
df.any()

a     True
b     True
c     True
d     True
e    False
f     True
dtype: bool

In [96]:
df.notnull().all()

a     True
b     True
c    False
d     True
e     True
f     True
dtype: bool

In [99]:
df.isnull().any()

a    False
b    False
c     True
d    False
e    False
f    False
dtype: bool